Revit 2024 API
NavisworksExportOptions Class
 Options which controls the Navisworks export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class NavisworksExportOptions : IDisposable
Visual Basic
Public Class NavisworksExportOptions _
	Implements IDisposable
Visual C++
public ref class NavisworksExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NavisworksExportOptions
See Also
NavisworksExportOptions Members
Autodesk.Revit.DB Namespace